[
    {
        "title": "HTML, CSS & JavaScript",
        "description": "Proficient in writing clean JavaScript, crafting semantic HTML markup, and creating visually appealing responsive CSS for building dynamic web applications.",
        "icon": "JS"
    },
    {
        "title": "Angular & React",
        "description": "Experienced in developing scalable web apps with Angular, leveraging its powerful features and modular architecture. Proficient in creating reusable UI components with React.",
        "icon": "React"
    },
    {
        "title": "AWS",
        "description": "Certified AWS Solutions Architect and Developer Associate with hands-on experience in deploying & managing applications using services like EC2, S3, and Lambda.",
        "icon": "AWS"
    },
    {
        "title": "Bootstrap & Tailwind CSS",
        "description": "Experienced in rapidly building responsive, visually appealing UIs with Bootstrap's components. Proficient in utilizing Tailwind CSS for custom, utility-first designs.",
        "icon": "BOOT"
    },
    {
        "title": "Python",
        "description": "Proficient in utilizing Python for developing data science and machine learning models, leveraging frameworks like PyTorch and TensorFlow.",
        "icon": "Python"
    },
    {
        "title": "SQL, Postgres & Snowflake",
        "description": "Skilled in writing optimized SQL queries, managing PostgreSQL databases, and leveraging Snowflake for scalable data warehousing and analytics.",
        "icon": "SQL"
    },
    {
        "title": "Kubernetes & Docker",
        "description": "Experienced in containerizing applications with Docker and orchestrating deployments using Kubernetes for efficient resource utilization and high availability.",
        "icon": "KUBE"
    },
    {
        "title": "Tableau & Excel",
        "description": "Adept at creating interactive data visualizations with Tableau for effective data exploration. Skilled in leveraging Excel for data analysis and reporting.",
        "icon": "Excel"
    }
]